Билет03/Documents/НачислениеЗарплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>НачислениеЗарплаты</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>CalculationRegister.НачисленияСотрудникам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.ОсновныеНачисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>График</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Графики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйПериодНачало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазовыйПериодКонец</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодДействияНачало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодДействияКонец</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Билет03/CalculationRegisters/НачисленияСотрудникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<CalculationRegister>
		<Properties>
			<Name>НачисленияСотрудникам</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРабот</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРабот.Resource.Дней</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРабот.Dimension.Дата</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтработанноЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВечерниеЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Графики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Билет03/InformationRegisters/СведеньяОСотрудниках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СведеньяОСотрудниках</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Билет03/Documents/НачислениеЗарплаты/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр НачисленияСотрудникам
	Движения.НачисленияСотрудникам.Очистить();
	Движения.НачисленияСотрудникам.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НачислениеЗарплатыНачисления.НомерСтроки КАК НомерСтроки,
		|	НачислениеЗарплатыНачисления.Сотрудник КАК Сотрудник,
		|	НачислениеЗарплатыНачисления.Подразделение КАК Подразделение,
		|	НачислениеЗарплатыНачисления.ВидРасчета КАК ВидРасчета,
		|	НачислениеЗарплатыНачисления.График КАК График,
		|	НачислениеЗарплатыНачисления.БазовыйПериодНачало КАК БазовыйПериодНачало,
		|	НачислениеЗарплатыНачисления.БазовыйПериодКонец КАК БазовыйПериодКонец,
		|	НачислениеЗарплатыНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
		|	НачислениеЗарплатыНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
		|	СведеньяОСотрудникахСрезПоследних.Оклад КАК Параметр
		|ИЗ
		|	Документ.НачислениеЗарплаты.Начисления КАК НачислениеЗарплатыНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведеньяОСотрудниках.СрезПоследних(&Дата, ) КАК СведеньяОСотрудникахСрезПоследних
		|		ПО НачислениеЗарплатыНачисления.Сотрудник = СведеньяОСотрудникахСрезПоследних.Сотрудник
		|ГДЕ
		|	НачислениеЗарплатыНачисления.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка	= РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.НачисленияСотрудникам.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
		Движение.ПериодРегистрации	= Дата;
	КонецЦикла;
	
	// !! Обработка сторно записей (командировка может вводится задним числом)
	СторноЗаписи = Движения.НачисленияСотрудникам.ПолучитьДополнение();
	Для Каждого Запись из СторноЗаписи Цикл
		Движение = Движения.НачисленияСотрудникам.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Запись);
		Движение.ПериодРегистрации = Запись.ПериодРегистрацииСторно;
		Движение.ПериодДействияНачало = Запись.ПериодДействияНачалоСторно;
		Движение.ПериодДействияКонец = Запись.ПериодДействияКонецСторно;
		Движение.Сторно = Истина;
	КонецЦикла;
	
	Движения.Записать();
	
	Расчет.РассчитатьНачисления(Ссылка);
	
КонецПроцедуры
